using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace hangman
{
    static class DateBank
    {

       public static string ChoosenCategory;//переменная с выбранной категорией
       public static string HiddenWord;//переменная с загаданным словом
       public static int HiddenWordLettersCount = 0;//количество букв в загаданном слове
       public static int Index = 0;//просто индекс
       public static char GuessLetter;//буква которую вписал пользователь
       public static int ErrorLetterCheck = 0;//есть цикл фор. проверка:
                                //если буква введённая пользователем равна той же букве в загаданном слове, то errorLetterCheck инкрементируется



        /*массив с числом элементов равным количеству букв в загаданном слове
        с андерскорами:*/
        public static char[] HiddenWordLettersArray = new char[50];


        /* массив с числом элементов равным количеству букв в загаданном слове
        без андерскоров:*/
        public static char[] HiddenWordLettersShowArray = new char[50];
        public static int RightLetter; //сколько раз пользователь угадал букву
        public static int ErrorLetter; //сколько раз пользователь не угадал букву
    }


    static class words
    {
        public static string[] categories =
        {
            "Фрукты и ягоды",
            "Страны",
            "Спорт",
            "Профессии",
            "Музыкальные инструменты"
        };

        public static string[] fruits = {
            "яблоко",
            "банан",
            "груша",
            "апельсин",
            "мандарин",
            "лимон",
            "вишня",
            "клубника",
            "малина",
            "черника",
            "ананас",
            "манго",
            "киви",
            "джекфрут",
            "гуава",
            "папайя",
            "личи",
            "гранат",
            "финик",
            "инжир",
            "грейпфрут",
            "лайм",
            "помело",
            "юзу",
            "клементин",
            "бергамот",
            "кумкват",
            "танжерин",
            "лиметта",
            "земляника",
            "ежевика",
            "смородина",
            "брусника",
            "клюква",
            "малина",
            "облепиха",
            "крыжовник",
            "голубика",
            "персик",
            "нектарин",
            "абрикос",
            "слива",
            "черешня",
            "гранат",
            "физалис",
            "хурма",
            "дыня",
            "арбуз",
            "авокадо",
            "кокос"
        };
        public static string[] musicalinstruments = {
            "гитара",
            "скрипка",
            "виолончель",
            "контрабас",
            "арфа",
            "мандолина",
            "балалайка",
            "лютня",
            "ситар",
            "гусли",
            "флейта",
            "кларнет",
            "саксофон",
            "труба",
            "валторна",
            "тромбон",
            "туба",
            "саксофон",
            "тромбон",
            "труба",
            "барабаны",
            "бочки",
            "тарелки",
            "тамбурин",
            "маримба",
            "ксилофон",
            "вибрафон",
            "кастаньеты",
            "тримбала",
            "пианино",
            "рояль",
            "синтезатор",
            "оркестрион",
            "мелотрон",
            "клавесин",
            "гармоника",
            "аккордеон",
            "баян",
            "балалайка",
            "калимба",
            "вуди",
            "сантур",
            "мелофон",
            "фантом",
            "ксилофон"
        };
        public static string[] jobs = {
            "врач",
            "учитель",
            "повар",
            "строитель",
            "водитель",
            "певец",
            "художник",
            "писатель",
            "программист",
            "мастер",
            "астроном",
            "биолог",
            "химик",
            "инженер",
            "юрист",
            "полицейский",
            "детектив",
            "стоматолог",
            "археолог",
            "ветеринар",
            "фотограф",
            "дизайнер",
            "актер",
            "музыкант",
            "танцор",
            "парикмахер",
            "кондитер",
            "журналист",
            "пилот",
            "аниматор",
            "геолог",
            "механик",
            "электрик",
            "кузнец",
            "гончар",
            "плотник",
            "садовник",
            "официант",
            "бармен",
            "библиотекарь",
            "тестировщик",
            "менеджер",
            "маркетолог",
            "аналитик"
        };
        public static string[] sport = {
            "футбол",
            "баскетбол",
            "теннис",
            "волейбол",
            "хоккей",
            "бег",
            "плавание",
            "бокс",
            "борьба",
            "гимнастика",
            "регби",
            "крикет",
            "хёрлинг",
            "софтбол",
            "бейсбол",
            "ракетбол",
            "бадминтон",
            "лыжи",
            "сноубординг",
            "велоспорт",
            "гольф",
            "карате",
            "дзюдо",
            "сёрфинг",
            "скалолазание",
            "рафтинг",
            "кайтинг",
            "паркур",
            "стрельба",
            "фехтование",
            "кёрлинг",
            "йога",
            "пилатес",
            "танцы",
            "фитнес",
            "аэробика",
            "бодибилдинг",
            "шахматы",
            "шашки",
            "бильярд",
            "боулинг",
            "гандбол"
        };
        public static string[] countries = {
            "франция",
            "италия",
            "испания",
            "германия",
            "великобритания",
            "россия",
            "польша",
            "украина",
            "греция",
            "португалия",
            "япония",
            "китай",
            "индия",
            "вьетнам",
            "индонезия",
            "таиланд",
            "филиппины",
            "израиль",
            "турция",
            "египет",
            "нигерия",
            "юар",
            "алжир",
            "кения",
            "марокко",
            "эфиопия",
            "танзания",
            "судан",
            "тунис",
            "сша",
            "канада",
            "бразилия",
            "мексика",
            "аргентина",
            "колумбия",
            "чили",
            "перу",
            "эквадор",
            "боливия",
            "австралия",
            "фиджи",
            "самоа",
            "тонга",
            "вануату",
            "кирибати",
            "тувалу",
            "науру",
            "куба",
            "исландия",
            "швейцария",
            "швеция",
            "норвегия",
            "дания",
            "финляндия",
            "ирландия",
            "бельгия",
            "нидерланды"
        };
    }

}
